01  WS-AREA-1 PIC X(200). 
01  WS-AREA-2 PIC X(200). 

PROCEDURE DIVISION.
    MOVE "This string is longer than 100 characters" TO WS-AREA-1.
    MOVE WS-AREA-1 TO WS-AREA-2. 
    DISPLAY WS-AREA-2. 
    STOP RUN.